/* ******************************************************************** **
** @@ MW9070
** @  Copyrt :
** @  Author :
** @  Modify :
** @  Update :
** @  Notes  :
** ******************************************************************** */

/* ******************************************************************** **
**                uses pre-compiled headers
** ******************************************************************** */

#include "stdafx.h"

#include "..\shared\file.h"
#include "..\shared\file_find.h"
#include "..\shared\file_walker.h"
#include "..\shared\search_bmh.h"
#include "..\shared\mmf.h"

/* ******************************************************************** **
** @@                   internal #defines
** ******************************************************************** */

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

#ifdef NDEBUG
#pragma optimize("gsy",on)
#pragma comment(linker,"/FILEALIGN:512 /MERGE:.rdata=.text /MERGE:.data=.text /SECTION:.text,EWR /IGNORE:4078")
#endif

/* ******************************************************************** **
** @@                   internal prototypes
** ******************************************************************** */

#pragma pack(push, 1)
struct MW9070_HEADER    // 306 bytes
{
   char        _pszSignature1[8];   // 0000
   char        _pszSignature2[4];   // 0008
   char        _pszSignature3[2];   // 000C
   char        _pszSignature4[10];  // 000E
   WORD        _w_0018;             // 0018
   WORD        _w_001A;             // 001A
   WORD        _w_001C;             // 001C
   WORD        _w_001E;             // 001E
   char        _pszText1[16];       // 0020
   char        _pszText2[16];       // 0030
   WORD        _w_0040;             // 0040
   WORD        _w_0042;             // 0042
   char        _pSignature5[10];    // 0044
   WORD        _w_004E;             // 004E
   WORD        _w_0050;             // 0050
   WORD        _wWaveLength;        // 0052
   WORD        _w_0054;             // 0054
   WORD        _w_0056;             // 0056
   WORD        _wPulseWidth;        // 0058
   WORD        _w_005A;             // 005A
   WORD        _w_005C;             // 005C
   DWORD       _dwRange;            // 005E
   DWORD       _dwIOR;              // 0062
   DWORD       _dwFactor1;          // 0066
   DWORD       _dwFactor2;          // 006A
   DWORD       _dwFactor3;          // 006E
   DWORD       _dwFactor4;          // 0072
   WORD        _w_0076;             // 0076
   WORD        _w_0078;             // 0078
   WORD        _w_007A;             // 007A  // 0 - LSA // Screen
   WORD        _w_007C;             // 007C  // 0 - LSA // Screen
   WORD        _w_007E;             // 007E
   WORD        _w_0080;             // 0080
   WORD        _w_0082;             // 0082
   WORD        _w_0084;             // 0084
   WORD        _w_0086;             // 0086
   WORD        _w_0088;             // 0088
   WORD        _w_008A;             // 008A
   WORD        _w_008C;             // 008C
   WORD        _w_008E;             // 008E
   WORD        _w_0090;             // 0090
   WORD        _w_0092;             // 0092
   WORD        _w_0094;             // 0094
   WORD        _w_0096;             // 0096
   WORD        _w_0098;             // 0098
   WORD        _w_009A;             // 009A
   WORD        _wDay;               // 009C
   WORD        _wMonth;             // 009E
   WORD        _wYear;              // 00A0
   WORD        _wHour;              // 00A2
   WORD        _wMinutes;           // 00A4
   WORD        _w_X2coord;          // 00A6
   WORD        _w_00A8;             // 00A8
   WORD        _w_Ycoord;           // 00AA
   WORD        _w_Y2coord;          // 00AC
   WORD        _w_Xcoord;           // 00AE
   WORD        _wTraceStart;        // 00B0
   WORD        _wRelLevel;          // 00B2
   WORD        _w_00B4;             // 00B4
   WORD        _w_00B6;             // 00B6
   WORD        _w_00B8;             // 00B8
   WORD        _wAvrgCounts;        // 00BA
   WORD        _w_00BC;             // 00BC
   WORD        _w_00BE;             // 00BE
   WORD        _w_00C0;             // 00C0
   WORD        _wPos_C2;            // 00C2
   WORD        _w_00C4;             // 00CA
   WORD        _wPos_C1;            // 00C6
   WORD        _w_00C8;             // 00C8
   WORD        _w_00CA;             // 00CA
   WORD        _w_00CC;             // 00CC
   WORD        _w_00CE;             // 00CE
   WORD        _w_00D0;             // 00D0
   WORD        _w_00D2;             // 00D2
   WORD        _w_00D4;             // 00D4
   WORD        _w_00D6;             // 00D6
   WORD        _w_00D8;             // 00D8
   WORD        _w_00DA;             // 00DA
   WORD        _w_00DC;             // 00DC
   WORD        _w_00DE;             // 00DE
   WORD        _w_00E0;             // 00E0
   WORD        _w_00E2;             // 00E2
   WORD        _w_00E4;             // 00E4
   WORD        _w_00E6;             // 00E6
   WORD        _w_00E8;             // 00E8
   WORD        _w_00EA;             // 00EA
   WORD        _w_00EC;             // 00EC
   WORD        _w_00EE;             // 00EE
   WORD        _w_00F0;             // 00F0
   WORD        _w_00F2;             // 00F2
   WORD        _w_00F4;             // 00F4
   WORD        _w_00F6;             // 00F6
   WORD        _w_EventCnt;         // 00F8
   WORD        _w_00FA;             // 00FA
   WORD        _w_00FC;             // 00FA
   WORD        _w_00FE;             // 00FE
   WORD        _w_0100;             // 0100
   WORD        _w_0102;             // 0102
   WORD        _w_0104;             // 0104
   WORD        _w_0106;             // 0106
   WORD        _w_0108;             // 0108
   WORD        _w_010A;             // 010A
   WORD        _w_010C;             // 010C
   WORD        _w_010E;             // 010E
   WORD        _w_0110;             // 0110
   WORD        _w_0112;             // 0112
   WORD        _w_0114;             // 0114
   WORD        _w_0116;             // 0116
   WORD        _w_0118;             // 0118
   WORD        _w_011A;             // 011A
   WORD        _w_011C;             // 011C
   WORD        _w_011E;             // 011E
   WORD        _w_0120;             // 0120
   WORD        _w_0122;             // 0122
   WORD        _w_0124;             // 0124
   WORD        _w_0126;             // 0126
   WORD        _w_0128;             // 0128
   WORD        _w_012A;             // 012A
   WORD        _w_012C;             // 012C
   WORD        _w_Strange;          // 012E
   WORD        _w_DataPts;          // 0130
};
#pragma pack(pop)

#pragma pack(push, 1)
struct MW9070_BLOCK8    // 16 bytes
{
   WORD        _w_U1;
   WORD        _w_U2;
   WORD        _w_U3;
   WORD        _w_U4;
   WORD        _w_U5;
   WORD        _w_U6;
   WORD        _w_U7;
   WORD        _w_U8;
};
#pragma pack(pop)

#pragma pack(push, 1)
struct MW9070_EVENTS    // 30 bytes
{
   WORD        _w_PropagationTime;
   WORD        _w_Marker1_Shift;
   WORD        _w_Marker2_Shift;
   WORD        _w_Marker3_Shift;
   WORD        _w_Marker4_Shift;
   WORD        _w_Marker5_Shift;
   WORD        _w_U1;
   WORD        _w_EventNum;
   WORD        _w_U3;
   WORD        _w_U4;
   WORD        _w_U5;
   WORD        _w_U6;
   WORD        _w_DP_VertShift01;
   WORD        _w_DP_VertShift02;
   WORD        _w_DP_Count;
};
#pragma pack(pop)

#pragma pack(push, 1)
struct MW9070_SCALE    // 12 bytes
{
   WORD        _w_DP_Scale1;
   WORD        _w_DP_Scale2;
   WORD        _w_DP_Scale3;
